# Data Explorer Project

####  [Pandas Cheat Sheet](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf) for Data Wrangling

####  [Numpy Cheat Sheet](https://s3.amazonaws.com/assets.datacamp.com/blog_assets/Numpy_Python_Cheat_Sheet.pdf) for Matrices

Use All what you have learnt in programming for now to perform the following to Load `'needtobeclean.csv'` and  Explore it by :-

1. Build a Function that takes all Columns and check  its Type 
2. Build a Function that takes all Columns and check  if there is a None Value.
3. Build a Function that replace None Values of Numbers with Mean and all Strings with Mode .

# Basic Style

In [37]:
def all_type(df):
    #  it returns the Type of all Columns (e.g : if they are 4 columns..
    #  ....it will return ['Strings','Numbers','Numbers','Strings']
    return df.dtypes  
def clean(df):
    # it replaces the None Values with  Mean for Numbers and Mode for Strings
    i = 0
    for col in df.columns:
        if type(df.iloc[0, i]) == str:
            df[col].fillna(df[col].mode()[0], inplace=True)
        else:
            df[col].fillna(df[col].mean(), inplace=True)
        i += 1

In [38]:
df.iloc[0,3]

'No'

In [39]:
import pandas as pd
import numpy as np
df = pd.read_csv('needtobeclean.csv')
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1   France  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4      NaN  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [40]:
all_type(df)

Country       object
Age          float64
Salary       float64
Purchased     object
dtype: object

In [41]:
clean(df)
df

   Country        Age        Salary Purchased
0   France  44.000000  72000.000000        No
1   France  27.000000  48000.000000       Yes
2  Germany  30.000000  54000.000000        No
3    Spain  38.000000  61000.000000        No
4   France  40.000000  63777.777778       Yes
5   France  35.000000  58000.000000       Yes
6    Spain  38.777778  52000.000000        No
7   France  48.000000  79000.000000       Yes
8  Germany  50.000000  83000.000000        No
9   France  37.000000  67000.000000       Yes

# Master Style

In [45]:
# OOP Style 
class DataExplorer :
    #Attributes if any
    def __init__(self, df): #File name 
        self.df = df
    def all_type(self):
        return df.dtypes
    def clean(self):
        i = 0
        for col in self.df.columns:
            if type(self.df.iloc[0, i]) == str:
                self.df[col].fillna(self.df[col].mode()[0], inplace=True)
            else:
                self.df[col].fillna(self.df[col].mean(), inplace=True)
            i += 1

In [46]:
data = pd.read_csv('needtobeclean.csv')
data_exp = DataExplorer(data)
data_exp.all_type()

Country       object
Age          float64
Salary       float64
Purchased     object
dtype: object

In [47]:
data_exp.clean()
data

   Country        Age        Salary Purchased
0   France  44.000000  72000.000000        No
1   France  27.000000  48000.000000       Yes
2  Germany  30.000000  54000.000000        No
3    Spain  38.000000  61000.000000        No
4   France  40.000000  63777.777778       Yes
5   France  35.000000  58000.000000       Yes
6    Spain  38.777778  52000.000000        No
7   France  48.000000  79000.000000       Yes
8  Germany  50.000000  83000.000000        No
9   France  37.000000  67000.000000       Yes